//Вывести на экран  вторую цифру числа с конца,
//при условии что число больше 9
int a=367631659;
int b=a/10;
int c=a/10%10;
//System.Console.WriteLine(b);
System.Console.WriteLine(c);



