//Написать программу вычисления значения
//функции y = sin(a). (Класс Math)
double x, y;
x=Math.PI;
y=Math.Sin(x);
System.Console.WriteLine($"sin({x})={y}");


/*
//тип возвращаемого значения Имя_функции(аргумент функции)
double sin(double x)
{
    return Math.Sin(x);
}

double Sum(double a, double b)
{
    return a+b;
} 




void Pause()
{
    System.Console.WriteLine("Press any key");
}

double y=Sin(3.14);
System.Console.WriteLine(y);
Pause();
*/